Implementación Tiendita/Orquestración de Servicos/BypassCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:des="http://j2ee.netbeans.org/wsdl/Bypass/src/DescriptorWSDL">
  <soapenv:Body>
    <des:DescriptorWSDLOperation>
      <tarjeta>100001</tarjeta>
      <monto>5.8</monto>
    </des:DescriptorWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>